drop schema if exists shard_system;
drop schema if exists shard_student;
drop schema if exists shard_finance;
drop schema if exists shard_biz;
create schema shard_system default character set utf8mb4;
create schema shard_student default character set utf8mb4;
create schema shard_finance default character set utf8mb4;
create schema shard_biz default character set utf8mb4;

use shard_system;
set names utf8mb4;

/*==============================================================*/
/* Table: sys_dept                                              */
/*==============================================================*/
create table sys_dept
(
   id                   int unsigned not null auto_increment  comment '部门 id',
   name                 varchar(20) not null  comment '部门名称',
   parent_id            int unsigned not null default 0  comment '上级部门id',
   level                varchar(200) not null  comment '部门层级',
   sequence             int unsigned not null default 0  comment '部门在当前层级下的顺序，由小到大',
   status               tinyint unsigned not null default 1  comment '状态，1：正常，0：冻结',
   remark               varchar(200)  comment '备注',
   operate_ip           varchar(20) not null  comment '最后一次更新操作者的ip地址',
   operator             int unsigned not null  comment '操作者 id',
   created_at           datetime not null default CURRENT_TIMESTAMP  comment '创建时间',
   modified_at          datetime not null default CURRENT_TIMESTAMP  comment '最后一次更新时间',
   primary key (id)
);

/*==============================================================*/
/* Table: sys_user                                              */
/*==============================================================*/
create table sys_user
(
   id                   int unsigned not null auto_increment  comment '用户 id',
   username             varchar(20) not null  comment '用户名称（登录名）',
   password             varchar(40) not null  comment '加密后的密码',
   password_salt        varchar(32) default '-1'  comment '用于加密用的“盐”',
   real_name            varchar(64)  comment '真实姓名',
   mobile_number        varchar(11) not null  comment '手机号',
   email                varchar(100) not null  comment '邮箱',
   dept_id              int unsigned not null default 0  comment '用户所在部门的id',
   status               tinyint unsigned not null default 1  comment '状态，1：正常，0：冻结状态，2：删除',
   remark               varchar(200)  comment '备注',
   operate_ip           varchar(20) not null  comment '最后一次更新者的ip地址',
   operator             int unsigned not null  comment '操作者 id',
   created_at           datetime not null default CURRENT_TIMESTAMP  comment '创建时间',
   modified_at          datetime not null default CURRENT_TIMESTAMP  comment '最后一次更新时间',
   primary key (id)
);

-- 用户表
INSERT INTO `sys_user` (`username`, `real_name`, `mobile_number`, `email`, `password`, `password_salt`, `dept_id`, `status`, `remark`, `operate_ip`, `operator`, `created_at`, `modified_at`) VALUES
 ('administrator', '超级管理员', '13800138000', 'andy@lovesofttech.com', '123', '1', '1', '1', '请勿删除', '', '0', '2020-01-04', '2020-01-04')
,('mike', '迈克', '13800138001', 'mike@lovesofttech.com', '123', '1', '1', '1', '招生科', '', '1', '2020-01-04', '2020-01-04')
,('rose', '罗丝', '13800138002', 'rose@lovesofttech.com', '123', '1', '1', '1', '教务科', '', '1', '2020-01-04', '2020-01-04')
,('tom', '汤姆', '13800138003', 'tom@lovesofttech.com', '123', '1', '1', '1', '财务科', '', '1', '2020-01-04', '2020-01-04')
,('jerry', '杰瑞', '13800138004', 'jerry@lovesofttech.com', '123', '1', '1', '1', '采购科', '', '1', '2020-01-04', '2020-01-04')
;

-- 部门表
INSERT INTO `sys_dept` (`name`, `parent_id`, `level`, `sequence`, `status`, `remark`, `operate_ip`, `operator`, `created_at`, `modified_at`) VALUES
 ('技术部', '0', '1', '100', '1', '技术', '', '1', '2020-01-04', '2020-01-04')
,('研发后端', '1', '2', '110', '1', '后端', '', '1', '2020-01-04', '2020-01-04')
,('研发前端', '1', '2', '120', '1', '前端', '', '1', '2020-01-04', '2020-01-04')
,('产品', '1', '2', '130', '1', '产品', '', '1', '2020-01-04', '2020-01-04')
,('设计', '1', '2', '140', '1', 'UI/UE', '', '1', '2020-01-04', '2020-01-04')
,('测试', '1', '2', '150', '1', '测试', '', '1', '2020-01-04', '2020-01-04')
,('运营部', '0', '1', '200', '1', '运营', '', '1', '2020-01-04', '2020-01-04')
,('市场部', '0', '1', '300', '1', '市场', '', '1', '2020-01-04', '2020-01-04')
,('人事部', '0', '1', '400', '1', '人事', '', '1', '2020-01-04', '2020-01-04')
,('财务部', '0', '1', '500', '1', '财务', '', '1', '2020-01-04', '2020-01-04')
;

use shard_student;
drop table if exists edu_student;

/*==============================================================*/
/* Table: edu_student                                           */
/*==============================================================*/
create table edu_student
(
   id                   int unsigned not null auto_increment  comment '学生id',
   stu_unique_num       int unsigned  comment '学生序号（学籍编号），年份加六位数字，每年从1开始递增，六位的递增数字部分，不足的在前面加0',
   stu_unique_num_str   varchar(10)  comment '学生序号（学籍编号）字符格式，供查询',
   stu_name             varchar(100)  comment '姓名',
   sex                  int unsigned  comment '性别',
   id_number            varchar(18)  comment '身份证号码',
   phone                varchar(11)  comment '学生联系电话',
   parents_phone        varchar(50)  comment '家长联系电话',
   address              varchar(200)  comment '联系地址',
   dormitory_type       int unsigned  comment '住校情况，住校，不住校',
   grade_id             int unsigned  comment '年级 edu_grade.id',
   major_id             int unsigned  comment '专业 edu_major.id',
   register_type        int unsigned not null default 1300  comment '',
   status               int unsigned not null default 1  comment '',
   remark               varchar(3000)  comment '备注',
   operate_ip           varchar(20) not null  comment '最后一次更新操作者的ip地址',
   operator             int unsigned not null  comment '操作者 id',
   job_modified_at      datetime not null default CURRENT_TIMESTAMP  comment '后台任务：最后一次更新时间',
   created_at           datetime not null default CURRENT_TIMESTAMP  comment '创建/登记时间',
   modified_at          datetime not null default CURRENT_TIMESTAMP  comment '最后一次操作时间',
   primary key (id)
);

/*==============================================================*/
/* Index: uk_stu_unique_num_str                                 */
/*==============================================================*/
create unique index uk_stu_unique_num_str on edu_student
(
   stu_unique_num_str
);

INSERT INTO `edu_student` (`stu_unique_num`, `stu_name`, `sex`, `id_number`, `phone`, `parents_phone`, `address`, `dormitory_type`, `grade_id`, `major_id`, `status`, `operate_ip`, `operator`) VALUES
 ('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '1',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '2',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '3',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '4',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '5',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '6',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '7',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '8',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '9',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '10', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '11', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '12', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '13', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '14', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '26', '15', '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '27', '1',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '27', '2',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '27', '3',  '1', '', '0')
,('2020000000', '', '1', '5221281988888888', '138001380', '139001390', '成都市金豪区财富路未来安居城8栋8楼', '2', '27', '4',  '1', '', '0')
;

update edu_student set
stu_unique_num = stu_unique_num + id,
stu_unique_num_str = stu_unique_num,
grade_id = 1,
remark = 'test student',
stu_name = CONCAT('stu-test-', id),
major_id = id,
id_number = CONCAT(id_number, id),
phone = CONCAT(phone, id),
parents_phone = CONCAT(parents_phone, id),
address = CONCAT(address, id, '0', id%2);

update edu_student set major_id = id - 18 where id > 51;
update edu_student set sex=2 where id%2=0;
update edu_student set id_number=CONCAT('5221282008110360', id) where id < 100;
update edu_student set id_number=CONCAT('522128200811036', id) where id > 99;
update edu_student set id_number=CONCAT('52212820081103600', id) where id < 10;

create table edu_student_2 as select * from edu_studen where id between 20 and 39;
create table edu_student_3 as select * from edu_student where id > 39;
delete from edu_student where id > 19;

ALTER TABLE `shard_student`.`edu_student_2` ADD PRIMARY KEY (`id`);
ALTER TABLE `shard_student`.`edu_student_3` ADD PRIMARY KEY (`id`);

use shard_finance;
drop table if exists fin_major_tuition_grade;

/*==============================================================*/
/* Table: fin_major_tuition_grade                               */
/*==============================================================*/
create table fin_major_tuition_grade
(
   id                   int unsigned not null auto_increment  comment '',
   major_id             int unsigned  comment '专业Id',
   pay_year             int unsigned  comment '支付学年',
   tuition              DECIMAL(9,2) unsigned default 0  comment '学费',
   primary key (id)
);

/*==============================================================*/
/* Index: idx_major_id                                          */
/*==============================================================*/
create index idx_major_id on fin_major_tuition_grade
(
   major_id
);

INSERT INTO fin_major_tuition_grade (major_id, pay_year, tuition) VALUES
 (1, 2020, 16000)
,(2, 2020, 17000)
,(3, 2020, 18000)
,(4, 2020, 19000)
,(5, 2020, 20000)
,(6, 2020, 21000)
,(7, 2020, 22000)
,(8, 2020, 23000)
;

use shard_biz;
drop table if exists biz_trade;
drop table if exists biz_trade_1;
drop table if exists biz_trade_2;
drop table if exists biz_trade_3;

CREATE TABLE biz_trade (
  id bigint(20) NOT NULL AUTO_INCREMENT COMMENT '交易自动编号',
  biz_id int(11) NOT NULL COMMENT '商户ID',
  tid bigint(20) NOT NULL COMMENT '淘宝/天猫系统的交易ID',
  buyer_nick varchar(25) DEFAULT NULL COMMENT '买家帐号',
  payment decimal(9,2) DEFAULT '0.00' COMMENT '实付金额',
  status tinyint(4) DEFAULT '0' COMMENT '交易状态',
  pay_time int(11) DEFAULT NULL COMMENT '付款时间，为时间戳',
  PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='交易表';

create table biz_trade_1 like biz_trade;
create table biz_trade_2 like biz_trade;
create table biz_trade_3 like biz_trade;

INSERT INTO `biz_trade_1` (`id`, `biz_id`, `tid`, `buyer_nick`, `payment`, `status`, `pay_time`) VALUES
 ('1', '1', '1019436109', 'buyer-1', '158.00', '7', '1390577684')
,('2', '1', '1032653658', 'buyer-2', '129.00', '7', '1391227779')
,('3', '1', '1041238338', 'buyer-3', '139.00', '4', '1391747632')
,('4', '1', '1041259380', 'buyer-4', '298.00', '4', '1391748820')
,('5', '1', '1041239998', 'buyer-5', '258.00', '4', '1391747876')
,('6', '1', '1031008362', 'buyer-6', '158.00', '7', '1391062686')
,('7', '1', '1033756594', 'buyer-7', '218.00', '7', '1391315797')
,('8', '1', '1038968304', 'buyer-8', '168.00', '4', '1391654539')
,('9', '1', '1008972908', 'buyer-9', '168.00', '7', '1390310913')
,('10', '1', '1035517690', 'buyer-10', '158.00', '7', '1391428680')
,('11', '31', '1033567064', 'buyer-11', '288.00', '7', '1391306903')
,('12', '31', '1041656938', 'buyer-12', '139.00', '4', '1391758234')
,('13', '31', '1041686610', 'buyer-13', '158.00', '4', '1391759129')
,('14', '31', '995912752', 'buyer-14', '158.00', '7', '1389997268')
,('15', '31', '1041738062', 'buyer-15', '158.00', '4', '1391760308')
,('16', '31', '1041739606', 'buyer-16', '198.00', '4', '1391760344')
,('17', '31', '1031353728', 'buyer-17', '139.00', '7', '1391092198')
,('18', '31', '1041803618', 'buyer-18', '198.00', '4', '1391761893')
,('19', '31', '1032828229', 'buyer-19', '139.00', '7', '1391237830')
,('20', '31', '1041889837', 'buyer-20', '158.00', '4', '1391763240')
,('14401', '10681', '10065721775', 'buyer-14401', '30.00', '4', '1442015863')
,('14402', '10681', '10066194705', 'buyer-14402', '401.00', '4', '1442019129')
,('14403', '10681', '10062518318', 'buyer-14403', '84.00', '4', '1441955071')
,('14404', '10681', '10066338313', 'buyer-14404', '95.00', '4', '1442021279')
,('14405', '10681', '10067249106', 'buyer-14405', '86.00', '4', '1442030880')
,('14406', '10681', '10064942502', 'buyer-14406', '65.00', '4', '1441983043')
,('14407', '10681', '10069402492', 'buyer-14407', '90.00', '4', '1442054202')
,('14408', '10681', '10069563625', 'buyer-14408', '33.00', '4', '1442058516')
,('14409', '10681', '10069953896', 'buyer-14409', '95.00', '4', '1442061423')
,('14410', '10681', '10069954613', 'buyer-14410', '50.00', '4', '1442063027')
;
INSERT INTO biz_trade_2 (`id`, `biz_id`, `tid`, `buyer_nick`, `payment`, `status`, `pay_time`) VALUES
 ('14101', '10682', '9942380642', 'buyer-14101', '234.00', '8', '1440241463')
,('14102', '10682', '9942613370', 'buyer-14102', '68.00', '7', '1440244637')
,('14103', '10682', '9942376705', 'buyer-14103', '78.00', '7', '1440241830')
,('14104', '10682', '9945096884', 'buyer-14104', '68.00', '8', '1440296694')
,('14105', '10682', '9947481318', 'buyer-14105', '38.00', '7', '1440328505')
,('14106', '10682', '9948633431', 'buyer-14106', '125.00', '7', '1440341566')
,('14107', '10682', '9948977357', 'buyer-14107', '65.00', '7', '1440347616')
,('14108', '10682', '9949791921', 'buyer-14108', '86.00', '7', '1440380269')
,('14109', '10682', '9950692318', 'buyer-14109', '293.00', '7', '1440384020')
,('14110', '10682', '9950901922', 'buyer-14110', '140.00', '7', '1440385628')
;
INSERT INTO `biz_trade_3` (`id`, `biz_id`, `tid`, `buyer_nick`, `payment`, `status`, `pay_time`) VALUES
 ('14465', '13883', '10076280194', 'buyer-14465', '38.00', '4', '1442164006')
,('14464', '13883', '10076030070', 'buyer-14464', '38.00', '4', '1442158462')
,('14466', '13883', '10076025847', 'buyer-14466', '76.00', '4', '1442171149')
,('14463', '13883', '10075416245', 'buyer-14463', '65.00', '4', '1442152460')
,('14467', '13883', '10075246637', 'buyer-14467', '49.00', '4', '1442150871')
,('14462', '13883', '10074883183', 'buyer-14462', '775.00', '4', '1442150245')
,('14461', '13883', '10074849618', 'buyer-14461', '398.00', '4', '1442146295')
,('14460', '13883', '10074149306', 'buyer-14460', '56.00', '4', '1442136858')
,('14459', '13883', '10073998999', 'buyer-14459', '232.00', '4', '1442138782')
,('14457', '13883', '10073828053', 'buyer-14457', '38.00', '4', '1442133343')
;